class PathavaliItem {
  final String id;
  final String title;
  final String content;
  bool isFavorite;

  PathavaliItem({
    required this.id,
    required this.title,
    required this.content,
    this.isFavorite = false,
  });

  // Factory constructor to create a PathavaliItem from a map (e.g., from SQLite)
  factory PathavaliItem.fromMap(Map<String, dynamic> map) {
    return PathavaliItem(
      id: map['id'].toString(),
      title: map['title'],
      content: map['content'],
      isFavorite: map['isFavorite'] == 1,
    );
  }

  // Method to convert a PathavaliItem to a map (e.g., for inserting into SQLite)
  Map<String, dynamic> toMap() {
    return {
      'id': id,
      'title': title,
      'content': content,
      'isFavorite': isFavorite ? 1 : 0,
    };
  }
}

// Data corresponding to the provided Hindi list
final List<PathavaliItem> pathavaliList = [
  PathavaliItem(
    id: "1",
    title: "प्रातः स्मरण एवं मंगलाचरण",
    content: '''॥ प्रातः स्मरण एवं मंगलाचरण ॥

श्री गोवर्धन नाथ पाद युगलम हे यंगवीन प्रियं ।
नित्यं श्री मधुराधिपं सुखकरं श्री विट्ठलेशं मुदा ॥

श्रीमदद्वारवतीश गोकुल पति श्री गोकुलेन्दुं विभुं ।
श्री मन मन्मथ मोहनं नटवरं श्री बालकृष्णं भजे ॥

श्रीमद वल्लभ विट्ठ्लो  गिरिधरं  गोविन्दराया मिधम ।
श्रीमद बालकृष्ण गोकुलपति नाथं रघुणाम तथा ॥

एवं श्री यदुनायकं किल घनश्यामं च तद् वंशजान् ।
कालिन्दिन स्व गुरुं गिरिं गुरु विभुं स्वीयत प्रभुश्च स्मरेत ॥

चिन्ता सन्तान हन्तारो यत्पादांबुज रेणवः।
स्वीयानां तान्निजार्यान प्रणमामि मुहुर्मुहुः ॥१॥

यदनुग्रहतो जन्तुः सर्व दुःखतिगो भवेत ।
तमहं सर्वदा वंदे श्री मद वल्लभ नन्दनम॥२॥

अज्ञान तिमिरान्धस्य ज्ञानान्जनशलाकया ।
चक्षुरुन्मीलितं येन तस्मै श्री गुरुवै नमः ॥३॥

नमामि हृदये शेषे लीलाक्षीराब्धिशायिनम ।
लक्ष्मी सहस्त्रलीलाभिः सेव्यमानं कलानिधिम॥४॥

चतुर्भिश्च चतुर्भिश्च चतुर्भिश्च त्रिभिस्तथा ।
षडभिर्विराजते योSसौ  पंचधा हृदये ममः ॥५॥
॥इति श्री मंगलाचरण संपूर्णम॥

॥श्रीमदाचार्य चरण कमलेभ्य नमः॥
''',
  ),
  PathavaliItem(
    id: "2",
    title: "सर्वोत्तम स्तोत्र (संस्कृत)",
    content: '''॥ सर्वोत्तम स्तोत्र (संस्कृत) ॥
प्राकृत धर्मानाश्रयम प्राकृत निखिल धर्म रूपमिति ।
निगम प्रतिपाद्यमं यत्तच्छुद्धं साकृत सतौमि ॥१॥

कलिकाल तमश्छन्न दृष्टित्वा द्विदुषामपि ।
संप्रत्य विषयस्तस्य माहात्म्यं समभूदभुवि॥२॥

दयया निज माहात्म्यं करिष्यन्प्रकटं हरिः ।
वाण्या यदा तदा स्वास्यं प्रादुर्भूतं चकार हि ॥३॥

तदुक्तमपि दुर्बोधं सुबोधं स्याद्यथा तथा ।
तन्नामाष्टोरतरशतं प्रवक्ष्याम्यखिलाघहृत ॥४॥

ऋषिरग्नि कुमारस्तु नाम्नां छ्न्दो जगत्यसौ ।
श्री कृश्णास्यं देवता च बीजं कारुणिकः प्रभुः ॥५॥

विनियोगो भक्तियोग  प्रतिबंध विनाशने ।
कृष्णाधरामृतास्वादसिद्धिरत्र न संशयः ॥६॥

आनंदः परमानंदः श्रीकृष्णस्यं कृपानिधिः ।
दैवोद्धारप्रयत्नात्मा स्मृतिमात्रार्तिनाशनः ॥७॥

श्री भागवत गूढार्थ प्रकाशन परायणः ।
साकार ब्रह्मवादैक स्थापको वेदपारगः ॥८॥

मायावाद निराकर्ता सर्ववाद निरासकृत ।
भक्तिमार्गाब्जमार्तण्डः स्त्रीशूद्राद्युदधृतिक्षमः ॥९॥

अंगीकृतयैव गोपीशवल्लभीकृतमानवः ।
अंगीकृतौ समर्यादो महाकारुणिको विभुः ॥१०॥

अदेयदानदक्षश्च महोदारचरित्रवान ।
प्राकृतानुकृतिव्याज मोहितासुर मानुषः ॥११॥

वैश्वानरो वल्लभाख्यः सद्रूपो हितकृत्सताम ।
जनशिक्षाकृते कृष्ण भक्तिकृन्न खिलेष्टदः ॥१२॥

सर्वलक्षण सम्पन्नः श्रीकृष्णज्ञानदो गुरुः ।
स्वानन्दतुन्दिलः पद्मदलायतविलोचनः ॥१३॥

कृपादृग्वृष्टिसंहृष्ट दासदासी प्रियः पतिः ।
रोषदृक्पात संप्लुष्टभक्तद्विड भक्त सेवितः ॥१४॥

सुखसेव्यो दुराराध्यो दुर्लभांध्रिसरोरुहः ।
उग्रप्रतापो वाक्सीधु पूरिता शेषसेवकः ॥१५॥

श्री भागवत पीयूष समुद्र मथनक्षमः ।
तत्सारभूत रासस्त्री भाव पूरित विग्रहः ॥१६॥

सान्निध्यम्मात्रदत्तश्रीकृष्णप्रेमा विमुक्तिदः ।
रासलीलैकतात्पर्यः कृपयैतत्कथाप्रदः ॥१७॥

विरहानुभवैकार्थसर्वत्यागोपदेशकः ।
भक्त्याचारोपदेष्टा च कर्ममार्गप्रवर्तकः॥१८॥

यागादौ भक्तिमार्गैक साधनत्वोपदेशकः ।
पूर्णानन्दः पूर्ण्कामो वाक्पतिर्विबुधेश्वरः ॥१९॥

कृष्णनामसहस्त्रस्य वक्ता भक्तपरायणः ।
भक्त्याचारोपदेशार्थ नानावाक्य निरूपकः ॥२०॥

स्वार्थो ज्झिताखिलप्राणप्रियस्तादृशवेष्टितः ।
स्वदासार्थ कृताशेष साधनः सर्वशक्तिधॄक ॥२१॥

भुवि भक्ति प्रचारैककृते स्वान्वयकृत्पिता ।
स्ववंशे स्थापिताशेष स्वमहात्म्यः स्मयापहः ॥२२॥

पतिव्रतापतिः पारलौकिकैहिक दानकृत ।
निगूढहृदयो नन्य भक्तेषु ज्ञापिताशयः ॥२३॥

उपासनादिमार्गाति मुग्ध मोह निवारकः ।
भक्तिमार्गे सर्वमार्ग वैलक्षण्यानुभूतिकृत ॥२४॥

पृथक्शरण मार्गोपदेष्टा श्रीकृष्णहार्दवित ।
प्रतिक्षण निकुंज स्थलीला रस सुपूरितः ॥२५॥

तत्कथाक्षिप्तचितस्त द्विस्मृतन्यो व्रजप्रियः ।
प्रियव्रजस्थितिः पुष्टिलीलाकर्ता रहः प्रियः ॥२६॥

भक्तेच्छापूरकः सर्वाज्ञात  लीलोतिमोहनः।
सर्वासक्तो भक्तमात्रासक्तः पतितपावनः ॥२७॥

स्वयशोगानसंहऋष्ठऋदयाम्भोजविष्टरः ।
यशः पीयूष्लहरीप्लावितान्यरसः परः ॥२८॥

लीलामृतरसार्द्रार्द्रीकृताखिलशरीरभृत ।
गोवर्धनस्थित्युत्साहल्लीला प्रेमपूरितः ॥२९॥

यज्ञभोक्ता यज्ञकर्ता चतुर्वर्ग विशारदः ।
सत्यप्रतिज्ञस्त्रिगुणोतीतो नयविशारदः ॥३०॥

स्वकीर्तिवर्द्धनस्तत्व सूत्रभाष्यप्रदर्शकः ।
मायावादाख्यतूलाग्निर्ब्रह्मवादनिरूपकः ॥३१॥

अप्राकृताखिलाकल्प भूषितः सहजस्मितः ।
त्रिलोकीभूषणं भूमिभाग्यं सहजसुन्दरः ॥३२॥

अशेषभक्त संप्रार्थ्य चरणाब्ज रजोधनः ।
इत्यानंद निधेः प्रोक्तां नाम्नामष्टोत्तरं शतम ॥३३॥

श्रृद्धाविशुद्ध बुद्धिर्यः पठत्यनुदिनं जनः ।
स तदेकमनाः सिद्धिमुक्तां प्राप्नोत्यसंशयम ॥३४॥

तदप्राप्तौ वृथा मोक्ष स्तदप्तौतदगतार्थता ।
अतः सर्वोत्तमं स्तोत्रं जप्यं कृष्ण रसार्थिभिः ॥३५॥

॥ इति श्रीमदग्निकुमारप्रोक्तं श्री सर्वोत्तमस्तोत्रं सम्पूर्णम ॥''',
  ),
  PathavaliItem(
    id: "3",
    title: "सर्वोत्तम स्तोत्र (गुजराती धौल)",
    content: '''॥ सर्वोत्तम स्तोत्र (गुजराती धौल) ॥

भले प्रकट्या श्री वल्लभदेव, श्री पुरुषोत्तम भूतल फरी जी।
नही प्राकृत धर्मनो लेश, अप्राकृत निज वपु धरी जी॥१॥

करे निगम निरूपण एम ते साकारनी स्तुति करी जी।
महा कलिकालदिक दोष, पंडित नी दृष्टि तिमीर भरी जी॥२॥

महिमा नव जाणे जेह, ते कहिये खरा सुर अरि जी।
वहाले दया करी मुख रूप, निज लीला प्रकट करी जी॥३॥

जेनी वाणी अति दुर्बोध, थाय सुबोध जेणे करी जी।
जेना अष्टोत्तर शत नाम, ते कहिये महा अघ हरी जी॥४॥

जेना ऋषिवर अग्निकुमार, जगती छंद नामे धरी जी।
श्री कृष्ण कमल मुख देव, बीज दृष्टी करुणा भरी जी॥५॥

जेनी भक्तिमां अंतराय, ते नाशनुं प्रयिजन सही जी।
आपे अधरामृतनी सिद्धि, ते मध्ये निश्चय करी जी॥६॥

ढाल

वहालो आनंद परमानंद कहेवाय, श्री कृष्ण कमल मुख कृपानिधि थाय॥७॥

वहालो दैवी उद्धारण प्रयत्न उपाय, जेना स्मरण मात्रथी आरती थाय ॥८॥

श्री भागवत गूढार्थ प्रकटाय, साकार ब्रह्मनो वाद स्थपाय॥९॥

वेद पारंग चौदह भुवन कहेवाय, मायावाद निराकृत सहु मली गाय॥१०॥

सर्व वादी निरास कीधा ते लखाय, भक्ति मार्ग सरस कमल विकसाय॥११॥

स्त्री शूद्रादिकने उद्धारवा समर्थ, जेना साधन बलथी न थाये अनर्थ॥१२॥

अंगीकार मात्रथी सर्व स्वकीये, कीधा श्रीगोपीजन पतिने प्रिये॥१३॥

अंगीकार करे मर्यादा अनुसार , महा करुणावंत समर्थ अपार॥१४॥

वहालो अदेय दान देवाने चतुर , महा उदार चरित्र करे बहुपुर॥१५॥

लीला देखाडी प्राकृतनी जेह , ते विषे मोह्या सुर रिपु तेह॥१६॥

वैश्वानर श्री वल्लभ छे नाम , वहालो सुन्दर रूप स्वजन हित काम॥१७॥

कृष्ण भक्ति करे जन शिक्षा काज, आपे अखिल इष्ट श्री वल्लभराज॥१८॥

सर्व लक्षण थी सम्पन्न विवेक, श्री कृष्ण ज्ञा्नदाता गुरु एक॥१९॥

पोताना आनंद थकी बहु पुष्ट, एना कमल पत्र सा नेत्र संतुष्ट॥२०॥

कृपा दृष्टि नो वृष्टि थी हरख्या मन, ते दास दासी प्रिय पतिने अनन्य॥२१॥

रोष दृष्टि करे भक्ति शत्रु प्रजाल,  भक्त सेवंता सुख सेवा रसाल॥२२॥

एमनी भक्तो बिना नही सेवा साध्य, ते कारण थी कहिए दुराराध्य॥२३॥

जेना चरण सरोज दुर्लभ दरशाय, तेना उग्र प्रताप त्रैलोकमा कहेवाय॥२४॥

वचनामृत करी पूर्या सेवकना अर्थ, श्री भागवत अमृत मथन समर्थ॥२५॥

तेनो सार कहीए ब्रज सुंदरी नो भाव, ते परिपूर्ण छे देह भराव॥२६॥

सान्निध्य मात्र करे कृष्ण प्रेम, भक्ति मुक्ति देवानु एहने नेम॥२७॥

एक रासलीलामां तेमनुं तान, प्रभु कृपा करी ने करे कथानुं दान॥२८॥

वहालो विरहना अनुभवने हित काज, सर्व त्याग जणाव्यो श्री वल्लभराज॥२९॥

उपदेश कर्यो भक्तोमार्ग आचार, लोकमाहे जणाव्यो कर्ममार्ग प्रचार॥३०॥

वेद शास्त्र कह्यां यज्ञादिक दान, तेनु फल मर्यादा भक्ति निदान॥३१॥

प्रभु पूर्णनंद छे पूरण काम, सरस्वति ना पति देव ईश अभिराम ॥३२॥

वहाले सहस्त्र कह्यां पुरुषोत्तम नाम, निजजननो आश्रयनुं छे धाम॥३३॥

भक्तिमार्गनी रीत करवा उपदेश, बहु ग्रंथ करीने टाल्यो संशयनो लेश॥३४॥

जेने पामवाने छोड्या प्राणथी प्रिये, एवा भक्त समाज बिराजे श्रीये॥३५॥

आप साधन करे निज दासने काज, एवा समर्थ श्री वल्लभ महाराज॥३६॥

करवा भक्ति प्रचार भूतल माही, वंश कीधा पिता थईने ग्रही बांही॥३७॥

सर्व सामर्थ्य धर्युं पोताने वंश, गर्व दूर करी टाल्यो संशय नो अंश॥३८॥

प्रभु पतिव्रताना पति साक्षात, करे परलोक दान विख्यात॥३९॥

जेना अंतःकरण छे गूढ अपार, अंगीकृतने जणाव्यो मननो विचार॥४०॥

उपासनादिक मारग जे अन्य, तेनो मोह टाली ने कीधा सेवक अनन्य॥४१॥

कर्यो निश्चय जे भक्ति सर्वथी विशेष, कीधो शरण मार्गनो जुदो उपदेश॥४२॥

श्री कृष्णना मननी जाणे वात, लीला कुंज बिहारी परिपूरण गात॥४३॥

कथारस मग्न सद छे चित्त , विसर्यु सौ ते थकी बीजूं वित्त॥४४॥

प्रिय छे घणुं व्रज ने व्रज नो वास, करे पुष्टिलीला एकांत विलास॥४५॥

करे भक्त इच्छा परिपूरण दान, नही निज लीला नु कोई ने ज्ञान॥४६॥

अति मोहित जेनुं शील घणों, नहि लोक विषे आसक्ति अणुं॥४७॥

निज भक्त विषे आसक्ति छे एक, प्रभु पावन कीधा पतित अनेक॥४८॥

जे करे पोताना गुणनुं गान, तेना हृदय कमल रहेवानु स्थान ॥४९॥

निज यशरूपी अमृत लहरि, तेथी भीजवी सर्व रस वासना हरी॥५०॥

प्रभु पोते सर्व थकी छे पर, न करे तुल्यता कोई अवर॥५१॥

लीलारस अमृत तरंग बहु, भीज्व्या छे भक्त शरीर सहु ॥५२॥

रुचि आपे गिरि गोवर्धन वास, ते लीला मां छे अतिशय उल्लास॥५३॥

करे यज्ञ भोग ने यज्ञ कर्म, आपे अर्थ कामने मोक्ष धर्म॥५४॥

प्रभु सत्य वचन छे त्रिगुणातीत, नीति चतुराई छे अति अगणित॥५५॥

करवा पोतानी कीर्ति प्रकाश, कर्युं व्याससूत्रनुं नूतन भाष्य॥५६॥

अति तुच्छ तुल जे मायावाद, करि भस्माग्नि स्थाप्यो ब्रह्मवाद॥५७॥

अप्राकृत भूषणनी अति कांति, हसतां मुख शोभे छे बहु भांति॥५८॥

प्रभु त्रण लोकना भूषणसार, प्रकट्या धरणी नुं भाग्य अपार॥५९॥

प्रभु सुंदरता छे अतिरी अनूप, केम वर्णन करी सकूं ए स्वरूप॥६०॥

सौ मांगे छे पोताना जन, चरणारविंद नी रज जे धन॥६१॥

ए कह्या एकसोने आठे नाम, श्री वल्लभ आनंदनुं छे धाम ॥६२॥

||वलण ||

जे कोई श्रद्धा करी नित्य गाय रे, तेनु मन पहेलुं स्थिर थाय रे ॥६३॥

अधरामृतनी सिद्धि पामे रे, तेमा संशय नु नही नाम रे॥६४॥

ए पाम्या बिना मोक्ष छे हीन रे, तेना फलमां मुक्ति छे लीन रे॥६५॥

तेथी सर्वोत्तम जप करवो रे, श्री कृष्ण रसे मन भरवो रे॥६६॥

श्री विट्ठल उच्चरित ए नाम रे, जे कोई गाये पूरे तेना काम रे॥६७॥

तेनो जन्म सफल करी लेखे रे, ते श्री व्रजभूषणजीना सुख देखे रे॥६८॥

श्री सर्वोत्तम स्तोत्र मूल रूप में (संस्कृत) यहाँ पढें।''',
  ),
  PathavaliItem(
    id: "4",
    title: "यमुनाष्टक",
    content: '''॥ यमुनाष्टक ॥

नमामि यमुनामहं सकल सिद्धि हेतुं मुदा
मुरारि पद पंकज स्फ़ुरदमन्द रेणुत्कटाम ।

तटस्थ नव कानन प्रकटमोद पुष्पाम्बुना
सुरासुरसुपूजित स्मरपितुः श्रियं बिभ्रतीम ॥१॥

कलिन्द गिरि मस्तके पतदमन्दपूरोज्ज्वला
विलासगमनोल्लसत्प्रकटगण्ड्शैलोन्न्ता ।

सघोषगति दन्तुरा समधिरूढदोलोत्तमा
मुकुन्दरतिवर्द्धिनी जयति पद्मबन्धोः सुता ॥२॥

भुवं भुवनपावनीमधिगतामनेकस्वनैः
प्रियाभिरिव सेवितां शुकमयूरहंसादिभिः ।

तरंगभुजकंकण प्रकटमुक्तिकावाकुका-
नितन्बतटसुन्दरीं नमत कृष्ण्तुर्यप्रियाम ॥३॥

अनन्तगुण भूषिते शिवविरंचिदेवस्तुते
घनाघननिभे सदा ध्रुवपराशराभीष्टदे ।

विशुद्ध मथुरातटे सकलगोपगोपीवृते
कृपाजलधिसंश्रिते मम मनः सुखं भावय ॥४॥

यया चरणपद्मजा मुररिपोः प्रियं भावुका
समागमनतो भवत्सकलसिद्धिदा सेवताम ।

तया सह्शतामियात्कमलजा सपत्नीवय-
हरिप्रियकलिन्दया मनसि मे सदा स्थीयताम ॥५॥

नमोस्तु यमुने सदा तव चरित्र मत्यद्भुतं
न जातु यमयातना भवति ते पयः पानतः ।

यमोपि भगिनीसुतान कथमुहन्ति दुष्टानपि
प्रियो भवति सेवनात्तव हरेर्यथा गोपिकाः ॥६॥

ममास्तु तव सन्निधौ तनुनवत्वमेतावता
न दुर्लभतमारतिर्मुररिपौ मुकुन्दप्रिये ।

अतोस्तु तव लालना सुरधुनी परं सुंगमा-
त्तवैव भुवि कीर्तिता न तु कदापि पुष्टिस्थितैः ॥७॥

स्तुति तव करोति कः कमलजासपत्नि प्रिये
हरेर्यदनुसेवया भवति सौख्यमामोक्षतः ।

इयं तव कथाधिका सकल गोपिका संगम-
स्मरश्रमजलाणुभिः सकल गात्रजैः संगमः ॥८॥

तवाष्टकमिदं मुदा पठति सूरसूते सदा
समस्तदुरितक्षयो भवति वै मुकुन्दे रतिः ।

तया सकलसिद्धयो मुररिपुश्च सन्तुष्यति
स्वभावविजयो भवेत वदति वल्लभः श्री हरेः ॥९॥

॥ इति श्री वल्लभाचार्य विरचितं यमुनाष्टकं सम्पूर्णम ॥''',
  ),
  PathavaliItem(
    id: "5",
    title: "मधुराष्टक",
    content: '''॥ मधुराष्टक ॥

अधरं मधुरं वदनं मधुरं, नयनं मधुरं हसितं मधुरं।
हृदयं मधुरं गमनं मधुरं, मधुराधिपते रखिलं मधुरं ॥१॥

वचनं मधुरं चरितं मधुरं, वसनं मधुरं वलितं मधुरं ।
चलितं मधुरं भ्रमितं मधुरं, मधुराधिपते रखिलं मधुरं ॥२॥

वेणुर्मधुरो रेनुर्मधुरः, पाणिर्मधुरः पादौ मधुरौ ।
नृत्यं मधुरं सख्यं मधुरं, मधुराधिपते रखिलं मधुरं ॥३॥

गीतं मधुरं पीतं मधुरं, भुक्तं मधुरं सुप्तं मधुरं ।
रूपं मधुरं तिलकं मधुरं, मधुराधिपते रखिलं मधुरं ॥४॥

करणं मधुरं तरणं मधुरं, हरणं मधुरं रमणं मधुरं ।
वमितं मधुरं शमितं मधुरं, मधुराधिपते रखिलं मधुरं ॥५॥

गुंजा मधुरा माला मधुरा, यमुना मधुरा वीचीर्मधुरा ।
सलिलं मधुरं कमलं मधुरं, मधुराधिपते रखिलं मधुरं ॥६॥

गोपी मधुरा लीला मधुरा, युक्तं मधुरं मुक्तं मधुरं।
दृष्टं मधुरं सृष्टं मधुरं, मधुराधिपते रखिलं मधुरं ॥७॥

गोपा मधुरा गावो मधुरा, यष्टिर्मधुरा सृष्टिर्मधुरा ।
दलितं मधुरं फ़लितं मधुरं, मधुराधिपते रखिलं मधुरं ॥८॥

॥इति श्रीमदवल्लभाचार्य विरचतिम मधुराष्टकं सम्पूर्णम॥
''',
  ),
  PathavaliItem(
    id: "6",
    title: "कृष्णाश्रय",
    content: '''॥ कृष्णाश्रय ॥

सर्वदा सर्वभावेन निश्चिन्तैः श्रीपतिर्भजेत् ।
तमेकं शरणं गत्वा सर्वभावेन सर्वथा ॥१॥

कलौ कृष्णकृपालुत्वं सर्वसाधनबाधके ।
ज्ञात्वैव शरणं यायात्सिद्धये कृष्णतत्परः ॥२॥

यतः कृष्णः स्वयं सर्वधर्माणां प्रभवो हरिः ।
धर्मरूपेण कृपया सर्वानन्दं प्रयच्छति ॥३॥

लाभपूजार्थयत्नेषु कृष्ण एव गतिर्मम ॥४॥

अपरिज्ञाननष्टेषु मन्त्रेष्वव्रतयोगिषु ।
तिरोहितार्थवेदेषु कृष्ण एव गतिर्मम ॥५॥

नानावादविनष्टेषु सर्वकर्मव्रतादिषु ।
पाषण्डैकप्रयत्नेषु कृष्ण एव गतिर्मम ॥६॥

अजामिलादिदोषाणां नाशकोऽनुभवे स्थितः ।
ज्ञापिताखिलमाहात्म्यः कृष्ण एव गतिर्मम ॥७॥

प्राकृताः सकला देवा गणितानन्दकं बृहत् ।
पूर्णानन्दो हरिस्तस्मात्कृष्ण एव गतिर्मम ॥८॥

विवेकधैर्यभक्त्यादिरहितस्य विशेषतः ।
पापासक्तस्य दीनस्य कृष्ण एव गतिर्मम ॥९॥

सर्वसामर्थ्यसहितः सर्वत्रैवाखिलार्थकृत् ।
शरणस्थसमुद्धारं कृष्णं विज्ञापयाम्यहम् ॥१०॥

कृष्णाश्रयमिदं स्तोत्रं यः पठेत् कृष्णसन्निधौ ।
तस्याश्रयो भवेत् कृष्ण इति श्रीवल्लभोऽब्रवीत् ॥११॥

॥ इति श्री वल्लभाचार्यविरचितः कृष्णाश्रयः सम्पूर्णः ॥''',
  ),
  PathavaliItem(
    id: "7",
    title: "बालबोध",
    content: '''॥ बालबोध ॥

नत्वा हरिं सदानन्दं सर्व सिद्धान्त संग्रहम ।
बालप्रबोधनार्थाय वदामि सुविनिश्चितम ॥१॥

धर्मार्थकाममोक्षाख्यास्च त्वारोsर्था मनीषिणाम ।
जीवेश्वर विचारेण द्विधा ते हि निरूपिताः ॥२॥

अलौकिकास्तु वेदोक्ताः साध्य साधन संयुता ।
लौकिकाऋषिभिः प्रोक्ताअं स्तथैवैश्वरशिक्षया ॥३॥

लौकिकांस्तु प्रवक्ष्यामि वेदादाद्या यतः स्थिता:।
धर्मशास्त्राणि नीतिश्च कामशास्त्राणि च क्रमात ॥४॥

त्रिवर्ग साधका नीति न तन्निर्णय उच्यते।
मोक्षे चत्वारि शास्त्राणि लौकिके परतः स्वतः ॥५॥

द्विधा द्वे द्वे स्वतस्त्र सांख्य योगौ प्रकीर्तितौ ।
त्यागा त्याग विभागेन सांख्ये त्यागः प्रकीर्तितः ॥६॥

अहन्ताममतानाशे सर्वथा निरहं कृतौ ।
स्वरूपस्थो यदा जीवः कृतार्थः स निगद्यते ॥७॥

तदर्थ प्रक्रिया काचित्पुराणेSपि निरूपिता ।
ऋषिभिर्बहुधा प्रोक्ता फ़लमेकमबाह्मतः ॥८॥

अत्यागे योगमार्गो हि त्यागोSपि मनसैव हि ।
यमादयस्तु कर्त्तव्याः सिद्धे योगे कृतार्थता ॥९॥

पराश्रयेण मोक्षस्तु द्विधा सोSपि निरूप्यते ।
ब्रह्म ब्राह्मणतां यातः तद्रूपेण सुसेव्यते ॥१०॥

ते सर्वथा न चाद्येन शास्त्रं किन्चिदुरीरितम ।
अतं शिवश्च विष्णुश्च जगतो हितकारकौ
वस्तुनः स्थिति संहारकार्यौ शास्त्र प्रवर्त्तकौ ॥११॥

ब्रह्मौव ताह्शं यस्मात्सर्वात्मकतयोदितौ ।
नर्दोषपूर्ण गुणता तत्तच्छास्त्रे तयोः कृता ॥१२॥

भोगमोक्षफले दातुं शक्तौ द्वावपि यद्यपि।
भोगः शिवेन मोक्षस्तु विष्णुनेति विनिश्चयः ॥१३॥

लोकेsपि यत्प्रभुर्भुंग्क्ते तन्न यच्छति कहिर्चित ।
अतिप्रियाय तदपि दीयते व्कचिदेव हि ॥१४॥

नियतार्थप्रदानेन तदीयत्वं तदाश्रयः ।
प्रत्येकं साधनं चैतद द्वितीयार्थे महाछ्र्मः ॥१५॥

जीवा स्वाभावतो दुष्टा दोषाभावाय सर्वदा ।
श्रवणादि ततः प्रेम्णा सर्वं कार्य हि सिद्दयति ॥१६॥

मोक्षस्तु विष्णोः सुलभो भोगश्च शिवतस्तथा ।
समर्पणेनात्मनो हि तदीयत्वं भवेदध्रुवम ॥१७॥

अतदीय तयाचापि केवलश्चेत समाश्रितः ।
तदाश्रयतदीयत्व बुद्धयै किंचित्समाचरेत ॥१८॥

स्वधर्ममनुतिष्ठन्वै भारद्वैगुण्य मन्यथा ।
इत्येवं कथितं सर्व नैताज्ज्ञाने भ्रमः पुनः ॥१९॥

॥इति श्रीवल्लभाचार्य विरचितो बालप्रबोधः सम्पूर्णः॥''',
  ),
  PathavaliItem(
    id: "8",
    title: "सिद्धांत रहस्यं",
    content: '''॥ सिद्धांत रहस्यं ॥

श्रावण स्यामले पक्षे एकादश्यं महानिशि ।
साक्षात भगवता प्रोक्तं तदक्षरश उच्यते ॥१॥

ब्रम सम्बंध करणात सर्वेषां देह जीवयोः ।
सर्वदोषनिवृत्तिर्हि दोषाः मंचविधां स्मृताः ॥२॥

सहजा देश कालोत्था लोकवेदनिरूपिताः ।
संयोगजाः सपर्शजाश्च न मन्तव्याः कथन्चन ॥३॥

अन्यथा सर्व दोषाणां न निवृत्तेः कथन्चन ।
असमर्पितवस्तुनां तस्माद्वर्जनमाचरेत ॥४॥

निवेदिभिः समर्प्यैव सर्व कुर्यादिति स्थितिः।
न मतं देवे देवस्य सामिभुक्तं समर्पणं ॥५॥

तस्मादादौ सर्वकार्ये सर्ववस्तु समर्पणम ।
दत्तापहारवचनं तथा च सकलं हरे ॥६॥

न ग्राह्ममिति वाक्यं हि भिन्न मार्गपरं मतम ।
सेवकानां यथालोके व्यवहारः प्रसिध्यति ॥७॥

तथा कार्य समर्प्यैव सर्वेषां ब्रह्मता ततः ।
गंगात्वं सर्वदोषाणां गुणदोषादि वर्णना
गंगात्वेन निरूप्या स्यात्त्द्वदत्रापि चैव हि ॥८॥

॥इति श्री वल्लभाचार्य विरचितं सिद्धान्तरहस्यं सम्पूर्णम॥
''',
  ),
  PathavaliItem(
    id: "9",
    title: "नवरत्नं",
    content: '''॥ नवरत्नं ॥

चिन्ताकापि न कार्या निवेदितात्मभिः कदापीति।
भगवानपि पुष्टिस्थो न करिष्यति लौकिकीं च गतिम ॥१॥

निवेदनण तु स्मर्त्तव्यं सर्वथा ताह्शैर्जनैः।
सर्वेश्चर्श्च सर्वात्मा निजेच्छातः करिष्यति ॥२॥

सर्वेषां प्रभु संबंधो न प्रत्येकमिति स्थितिः ।
अतोsय विनियोगेSपि चिन्ता का स्वस्य सोsपिचेत ॥३॥

अज्ञानादथवा ज्ञानात कृतमात्म निवेदनम ।
यैः कृष्णसात्कृतप्राणैस्तेषां का परिदेवना ॥४॥

तथा निवेदने चिन्ता त्याज्या श्री पुरुषोत्तमे ।
विनियोगेsपि सा त्याज्या समर्थो हि हरिः स्वतः ॥५॥

लोके स्वास्थ्यं तथा वेदे हरिस्तु न करिष्यति ।
पुष्टिमार्गस्थितो यस्मात साक्षिणो भवता खिलाः ॥६॥

सेवाकृतिर्गुरोराज्ञाsबाधनं वा हरोच्छया ।
अतः सेवा परं चित्तं विधाय स्थीयतां सुखम ॥७॥

चित्तोद्वेगं विधायापि हरिर्यद्यत करिष्यति ।
तथैव तस्य लीलेति मत्वा चिन्तां द्रुतं त्यजेत ॥८॥

तस्मात्सर्वातमना नित्यं श्री कृष्णः शरणं मम ।
वदद्भिरेव सततं स्थेयमित्येव मे मति ॥९॥

॥इति श्री वल्लभाचार्य विरचितं नवरत्नं समाप्तं॥''',
  ),
  PathavaliItem(
    id: "10",
    title: "चतु:श्लोकी",
    content: '''॥ चतु:श्लोकी ॥

सर्वदा सर्वभावेन भजनीयो व्रजाधिपः ।
स्वस्यायमेव धर्मो हि नान्यः क्वापि कदाचन ॥१॥

एवं सदा स्वकर्त्तव्यं स्वयमेव करिष्यति ।
प्रभुः सर्व समर्थो हि ततो निश्चिन्ततां व्रजेत ॥२॥

यदि श्री गोकुलाधीशो धृतः सर्वात्मना हृदि ।
ततः किमपरं बूहि लोकिकैर्वैदिकैरपि ॥३॥

अतः सर्वात्मना शश्ववतगोकुलेश्वर पादयोः ।
स्मरणं भजनं चापि न त्याज्यमिति मे मतिः ॥४॥

॥इति श्री वल्लभाचार्यविरचितं चतुःश्लोकी सम्पूर्णम॥''',
  ),
  PathavaliItem(
    id: "11",
    title: "श्री गिरिराजधार्याष्टकम",
    content: '''॥ श्री गिरिराजधार्याष्टकम ॥

भक्ताभिलाषा चरितानुसारी दुग्धादिचौर्यण यशोविसारी ।
कुमारिता नन्दित घोषनारि ममः प्रभु श्री गिरिराजधारी ॥१॥

ब्रजांगनावृन्द सदाबिहारी अंगैर्गुहागार तमोपहारी ।
क्रीडा रसावेश तमोभिसारी ममः प्रभु श्री गिरिराजधारी ॥२॥

वेणुस्वनानन्दित पन्नगारी रसातलानृत्य पद प्रचारी ।
क्रीडन्वयस्या कृतिदैत्यमारी ममः प्रभु श्री गिरिराजधारी ॥३॥

पुलिन्ददारा हित शम्बरारी रमासदोदार दयाप्रकारी ।
गोवर्धने कन्द फलोपहारी ममः प्रभु श्री गिरिराजधारी ॥४॥

कलिन्दजाकूल दुकूलहारी कुमारिका कामलावितारी ।
वृन्दावने गोधनवृन्दचारी ममः प्रभु श्री गिरिराजधारी ॥५॥

व्रजेन्द्र सर्वाधिक शर्मकारी महेन्द्र गर्वाधिक गर्वहारी ।
वृन्दावने कन्दफलोपहारी ममः प्रभु श्री गिरिराजधारी ॥६॥

मनः कलानाथ तमोविदारी वंशीरवाकारित तत्कुमारी ।
रासोत्सवोद्वेल्ल रसाब्धिसारी ममः प्रभु श्री गिरिराजधारी ॥७॥

मत्तद्विपोद्याम गतानुकारी लुण्ठ्त्प्रसुना प्रपदीनहारी ।
रामोरसस्पर्श करप्रसारी ममः प्रभु श्री गिरिराजधारी ॥८॥

॥ इति श्रीमद्वल्लभाचार्य विरचितं श्री गिरिराजधार्याष्टकम सम्पूर्णम ॥''',
  ),
  PathavaliItem(
    id: "12",
    title: "श्री नंदकुमाराष्टकं",
    content: '''॥ श्री नंदकुमाराष्टकं ॥

सुन्दर गोपालं उरवनमालं नयन विशालं दुःख हरं,
वृन्दावन चन्द्रं आनंदकंदं परमानन्दं धरणिधरं ।
वल्लभ घनश्यामं पूरण कामं अत्यभिरामं प्रीतिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥१॥

सुन्दरवारिज वदनं निर्जितमदनं आनन्दसदनं मुकुटधरं,
गुंजाकृतिहारं विपिनविहारं परमोदारं चीरहरम ।
वल्लभ पटपीतं कृतउपवीतं करनवनीतं विबुधवरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥२॥

शोभित मुख धूलं यमुना कूलं निपट अतूलं सुखदतरं,
मुख मण्डित रेणुं चारित धेनुं बाजित वेणुं मधुर सुरम ।
वल्लभ अति विमलं शुभपदकमलं नखरुचि अमलं तिमिरहरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥३॥

शिर मुकुट सुदेशं कुंचित केशं नटवरवेशं कामवरं,
मायाकृतमनुजं हलधर अनुजं प्रतिहदनुजं भारहरम ।
वल्लभ व्रजपालं सुभग सुचालं हित अनुकालं भाववरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥४॥

इन्दीवरभासं प्रकट्सुरासं कुसुमविकासं वंशीधरं,
हृतमन्मथमानं रूपनिधानं कृतकलिगानं चित्तहरं ।
वल्लभ मृदुहासं कुंजनिवासं विविधविलासं केलिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥५॥

अति परं प्रवीणं पालितदीनं भक्ताधीनं कर्मकरं,
मोहन मतिधीरं फणिबलवीरं हतपरवीरं तरलतरं ।
वल्लभ व्रजरमणं वारिजवदनं जलधरशमनं शैलधरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥६॥

जलधरद्युतिअंगं ललितत्रिभंगं बहुकृतिरंगं रसिकवरं,
गोकुलपरिवारं मदनाकारं कुंजविहारं गूढनरम ।
वल्लभ व्रजचन्दं सुभग सुचन्दं कृताअनन्दं भ्रांतिहरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥७॥

वंदित युग चरणं पावन करणं जगत उद्धरणं विमलधरं,
कालिय शिर गमनं कृत फणिनमनं घातित यमनं मृदुलतरं ।
वल्लभ दुःखहरणं निरमलचरणं अशरण शरणं मुक्तिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥८॥

॥ इति श्रीमद वल्लभाचार्य विरचितं नन्दकुमाराष्टकं समाप्तं ॥''',
  ),
  PathavaliItem(
    id: "13",
    title: "सिद्धांतमुक्तावली",
    content: '''॥ सिद्धांतमुक्तावली ॥

नत्वा हरिं प्रवक्ष्यामि स्वसिद्धांत विनिश्चयम।
कृष्ण सेवा सदा कार्या मानसी सा परा स्मृता॥१॥

चेतस्तस्प्रवणं सेवा तत्सिच्द्धयै तनुवित्तजा।
ततः संसारदुःखस्य निवृत्तिर्ब्रह्मबोधनम॥२॥

परं ब्रह्म तु कृष्णो हि सच्चिदानंदकं बृहत।
द्विरूपं तद्वि सर्वं स्यादेकं तस्माद्विलक्षणम॥३॥

अपरं तत्र पूर्वस्मिन वादिनो बहुधा जगुः।
मायिकं सगुणं कार्यं स्वतंत्र चेति नैकधा॥४॥

तदेवैतत्प्रकारेण भवतीति श्रुतेर्मतम।
द्विरूपं चापि गंगावज्ज्ञेयं सा जलरूपिणी॥५॥

माहात्म्यसंयुता नृणां सेवतांभुक्तिमुक्तिदा।
मर्यादामार्गविधिना तथाब्रह्मापि बुद्ध्यताम॥६॥

तत्रैव देवतामूर्तिर्भक्तया या हश्यते क्वचित।
गंगायांच विशेषेण प्रवाहाभेदबुद्धये॥७॥

प्रत्यक्षा सा न सर्वेषां प्राकाम्यं स्यात्तया जले।
विहिताच्च फलात्तद्धि प्रतीत्यापि विशिष्यते॥८॥

यथा जलं तथा सर्वं यथा शक्ता तथा बृहत।
यथा देवी तथा कृष्ण्स्तत्राप्येतदिहोच्यते॥९॥

जगत्तु त्रिविधं प्रोक्तं ब्रह्मविष्णुशिवास्ततः।
देवतारूपवत्प्रोक्ता ब्रह्मणीत्थं हरिर्मतः॥१०॥

कामचारस्तु लोकेस्मिब्रह्मदिभ्यो न चान्यथा ।
परमानन्दरूपे तु कृष्णे स्वात्मनि निश्चयः॥११॥

अतस्तु ब्रह्मवादेन कृष्णे बुद्धिर्विधीयताम।
आत्मनि ब्रह्मरूपे हि छिद्रा व्योम्नीव चेतनाः॥१२॥

उपाधिनाशे विज्ञाने ब्रह्मत्वत्वावबोधने।
गंगातीरस्थितो यद्वदेवतां तत्र पश्यति॥१३॥

तथा कृष्णं परं ब्रह्म स्वस्मिन ज्ञानी प्रपश्यति।
संसारी यस्तु भजते स दूरस्थो यथा तथा॥१४॥

अपेक्षित जलादीनामभावात्तत्र दुःखभाक।
तस्माच्छ्रीकृष्णमार्गस्थो विमुक्तः सर्वलोकतः॥१५॥

आत्मानंदसमुद्रस्थं कॄष्णमेव विचिन्तयेत।
लोकार्थी चेदभजेत कृष्णं क्लिष्टो भवति सर्वथा॥१६॥

क्लिष्टोपि चेदभजेत कॄष्णं लोको नश्यति सर्वथा।
ज्ञानाभावे पुष्टिमार्गी तिष्ठेत पूजोत्सवादिषु॥१७॥

मर्यादस्थस्तु गंगायां श्रीभगवततत्परः।
अनुग्रहः पुष्टिमार्गे नियामक इति स्थितिः॥१८॥

उभयोस्तु क्रमेणैव पूर्वोक्तैव फलिष्यति।
ज्ञानाधिको भक्तिमार्ग एवं तस्मान्निरूपितः॥१९॥

भक्तयभावे तु तीरस्थो यथा दुष्टैः स्वकर्मभिः।
अन्यथाभावनापन्नस्तस्मात्स्थानाच्च नश्यति॥२०॥

एवं स्वशास्त्रसर्वस्वं मया गुप्तं निरूपितम।
एतदवुध्वा विमुच्येत पुरुषः सर्वसंशयात॥२१॥

॥इति श्री वल्लभाचार्य विरचिता सिद्धांतमुक्तावली सम्पूर्ण॥''',
  ),
  PathavaliItem(
    id: "14",
    title: "पुष्टिप्रवाहमर्यादा",
    content: '''॥ पुष्टिप्रवाहमर्यादा ॥

पुष्टिप्रवाह मर्यादा विशेषेण पृथक पृथक।
जीव-देह-क्रियाभेदैः प्रवाहेण फलेन च॥१॥

वक्ष्यामि सर्वसन्देहा न भविष्यन्ति यच्छुतेः।
भक्तिमार्गस्यकथनात पुष्तिरस्तीति निश्चयः॥२॥

“द्वौ भूतसर्गा” वित्युक्तेः प्रवाहोSपि व्यवस्थितः।
वेदस्य विद्यमानत्वान्मर्यादापि व्यवथिता ॥३॥

कश्चितदेव हि भक्तो हि “यो मद्भक्त” इतीरणात।
सर्वत्रोत्कर्षकथनात पुष्टिरस्तीति निश्चयः॥४॥

न सर्वोतः प्रवाहादि भिन्नोवेदाच्च भेदतः।
“यदा यस्ये” ति वचना “न्नाहंवेदै” रितीरणात॥५॥

मार्गैकत्वेपि चेदन्त्यौ तनू भक्तयागमौ मतौ।
न तद्युक्तं सूत्रतोहि भिन्नौ युक्तया हि वैदिकः॥६॥

जीवदेहकृतीनां च भिन्नत्वं नित्यता श्रुतेः।
यथा तद्वत्पुष्टिमार्गे द्वयोरपि निषेधतः॥७॥

प्रमाण्भेदाद्भिन्नोहि पुष्टिमार्गो निरूपितः।
सर्गभेदं प्रवक्ष्यामि स्वरूपांगक्रियायुतम॥८॥

इच्छामात्रेण मनसा प्रवाहं सृष्टवान हरिः।
वचसा वेदमार्ग हि पुष्टिः कायेन निश्चयः॥९॥

मूलेच्छातः फलं लिके वेदोक्तं वैदिकेपि च।
कामेन तु फलं पुष्टौ निजेच्छातोsपि नैकता॥१०॥

“तानहं द्विषतो” वाक्याद्भिन्ना जीवाः प्रवाहिणः।
अत एवेतरौ भिन्नौ सान्तौ मोक्षप्रवेशतः॥११॥

तस्माज्जीवाः पुष्टिमार्गे भिन्ना एव न संशयः।
भगवदरूप सेवार्थं तत्सृष्टिर्नान्यथा भवेत॥१२॥

स्वरूपेणावतारेण लिंगेन च गुणेन च।
तारतम्यं न स्वरूपे देहे वा तत्क्रियासु वा॥१३॥

तथापि यावता कार्य तावत्त्स्य करोति हि।
ते हि द्विधा शुद्धमिश्रभेदान्मिश्रास्त्रिधा पुन॥१४॥

प्रवाहादिविभेदेन भगवतकार्यसिद्धये।
पुष्ट्याविमिश्राः सर्वज्ञाः प्रवाहेण क्रियारताः॥१५॥

मर्यादया गुणज्ञास्ते शुद्धाः प्रेम्णातिदुर्लभाः।
एवं सर्गस्तु तेषां हि फलं त्वत्र निरूप्यते॥१६॥

भगवानेव हि फलं स यथाssविर्भवेद्भुवि।
गुणस्वरूपभेदेन तथा तेषां फलं भवेत॥१७॥

आसक्तौ भगवानेव शापं दापयति क्वचित।
अहंकारेsथवा लोके तन्मार्गस्थापनाय हि॥१८॥

न ते पाषण्डतांयान्ति न च रोगाद्युपद्रवाः।
महानुभावाः प्रायेण शास्त्रं शुद्धत्वहेतवे॥१९॥

भगवत्तारतम्येन तारतम्यं भजन्ति हि।
वैदिकत्वं लौकिकत्वं कापट्यात्तेषु नान्यथा॥२०॥

वैष्णवत्वं हि सहजं ततोsन्यत्र विपर्ययः।
सम्बन्धिनस्तु ये जीवाः प्रवाहस्थास्तथाsपरे॥२१॥

चर्षणीशब्दवाच्यास्ते ते सर्वे सर्ववतर्मसु।
क्षणात्सर्वत्वमायान्ति रुचिस्तेषां न कुत्रचित॥२२॥

तेषां क्रियानुसारेण सर्वत्र शकलं फलं।
प्रवाहस्थान प्रवक्ष्यामि स्वरूपांगक्रियायुतान॥२३॥

जीवास्ते ह्मासुराः सर्वे “प्रवृत्तिं चेति” वर्णिताः।
ते च द्विधा प्रकीतर्यन्ते ह्मज्ञदुर्ज्ञविभेदतः॥२४॥

दुर्ज्ञास्ते भगवत्प्रोक्ता ह्मज्ञास्ताननु ये पुनः।
प्रवाहेपि समागत्य पुष्टिस्थस्तैर्न युज्यते॥
सोsपिस्तैस्तत्कुले जातः कर्मणा जायते यतः॥२५॥

॥इति श्रीमद वल्लभाचार्य विरचितः पुष्टिप्रवाहमर्यादाभेदः सम्पूर्ण॥''',
  ),
  PathavaliItem(
    id: "15",
    title: "विवेकधैर्याश्रय",
    content: '''॥ विवेकधैर्याश्रय ॥

विवेकधैर्ये सततं रक्षरणीय तथाश्रयः
विवेकस्तु “हरिः” सर्व निजेच्छातः करिष्यति॥१॥

प्रार्थिते वा ततः किं स्यात्‌ स्वाम्यभिप्रायसंशयात्‌।
सर्वत्र तस्य सर्वं हि सर्वसामर्थ्यमेव च॥२॥

अभिमानस्य संत्याज्यः स्वाम्यधीनत्व भावनात्‌।
विशेतश्वे दाज्ञा स्यादन्तः करणगोचरा॥३॥

तदा विशेषगत्यादि भाव्यं भिन्नं तु दैहिकात्‌।
आपद्‌गत्यादिकार्येषु हठस्त्याज्यश्च सर्वथा॥४॥

अनाग्रहश्च सर्वत्र धर्माधर्माग्रदर्शनम्‌।
विवेकोsयं समाख्यातोधैर्यं तु विनिरूप्यते॥५॥

त्रिदुःखसहनं धैर्यमामृतेः सर्वतः सदा।
तक्रवद्भेहवभाव्यं जडवद्‌गोपभार्यवत्‌॥६॥

प्रतीकारो यद्‌च्छातः सिद्धश्चेन्नाग्रही भवेत्‌।
भार्यादीनां तथान्येषामसतश्चाक्रमं सहेत्‌॥७॥

स्वयमिन्द्रियकार्याणि कायवाङ्‌मनसा त्यजेत्‌।
अशूरेणपि कर्त्तव्यं स्वस्यासामर्थ्यभावनात्‌॥८॥

अशक्ये हरिरेवास्ति सर्वमाश्रयतोभवेत्‌।
एतत्सहनमत्रोक्त्तमाश्रयोsतो निरूपयेत॥९॥

एहिके पारलोके च सर्वथा शरणं हरिः।
दुःखहानौ तथा पापे भये कामद्यपूरणे॥१०॥

भक्तदोहे भक्तयभावे भक्तैश्‍चापि क्रमे कृते।
अशक्ये वा सुशवये वा सर्वथा शरणं हरिः॥११॥

अहंकार कृते चैव पोष्य पोषणरक्षणे।
पोष्यातिक्रमणे चैव तथान्तेवास्यतिक्रमे॥१२॥

अलौकिक मनः सिद्धौ सर्वार्थं शरणं हरिः।
एवं चित्ते सदा भाव्यं वाचा च परिकीर्तयेत्‌॥१३॥

अन्यस्य भजनं तत्र स्वतो गमन मेव च।
प्रार्थनाकार्य मात्रेsपि ततोsन्यत्र विवर्जयेत्‌॥१४॥

अविश्वासो न कर्त्तव्यः सर्वथा वाधकस्तु सः।
ब्रह्मास्त्र चातकौ भाव्यौ प्राप्तं सेवेत निर्ममः॥१५॥

यथाकथंचित्‌ कार्याणि कुर्यादुच्चावचान्यपि।
किंवा प्रोक्तेन बहुना शरणं भावयेद्भरिम्‌॥१६॥

एवमाश्रयणं प्रोक्तं सर्वेषां सर्वदा हितम्‌।
कलौ भक्तयादिमार्गा हि दुस्साध्या इति मे मतिः॥१७॥

॥ इति श्री वल्लभाचर्यप्रोक्तं विवैकधैर्याश्रयं सम्पूर्णम्‌ ॥''',
  ),
  PathavaliItem(
    id: "16",
    title: "अंतःकरणप्रबोध",
    content: '''॥ अंतःकरणप्रबोध ॥

अंतःकरण मद्वाक्यं सावधानतया शृणु।
कृष्णात्परं नास्ति दैवं वस्तुतो दोषवर्जितं॥१॥

चाण्डाली चेद्राजपत्नि जाता राज्ञा च मानिता।
कदाचिदपमानेsपि मूलतः का क्षतिर्भवेत॥२॥

समर्पणादहं पूर्वमुत्तमः किं सदा स्थितः।
का ममाधमता भाव्या पश्चातापो यतो भवेत॥३॥

सत्यसंकल्पतो विष्णुर्नान्यथा तु करिष्यति।
आज्ञैव कार्या सततं स्वामिद्रोहोsन्यथा भवेत॥४॥

सेवकस्य तु धर्मोsयं स्वामी स्वस्य करिष्यति।
आज्ञा पूर्व तु या जाता गंगासागर संगमे॥५॥

याsपि पश्चानमधुवने न कृतं तद्द्द्वयं मया।
देहदेश परित्यागस्तृतीयो लोक गोचरः॥६॥

पश्चातापः कथं तत्र सेवकोहं न चान्यथा।
लौकिकप्रभुवत्कृष्णो न द्रष्टव्यः कदाचन॥७॥

सर्व समर्पितं भक्त्या कृतार्थोsसि सुखीभव।
प्रौढापि दुहिता यद्वत्‌ स्नेहान्न प्रेष्यते वरे॥८॥

तथा देहेन कर्त्तव्यं वरस्तुष्यति नान्यथा।
लोकवच्चेत्स्थिर्मे स्यात्‌ किंस्यादितिविचाराय॥९॥

अशक्ये हरिरेवास्ति मोहं मागाः कथञ्चन।
इतिश्री कृष्णदास्य वल्लभस्य हितं वचः॥१०॥
चित्तं प्रति यदाकर्ण्य भक्तो निश्चिंततां व्रजेत॥

॥ इतिश्रीमद्‌वल्लभाचार्यकृतोअंतःकरणप्रबोधः सम्पूर्णः ॥''',
  ),
  PathavaliItem(
    id: "17",
    title: "भक्तिवर्द्धिनी",
    content: '''॥ भक्तिवर्द्धिनी ॥

यथा भक्तिः प्रवृद्धा स्यात्तथोपायो निरूप्यते।
बीजभावे दृढ़े तु स्यात्यागाच्छवण कीर्त्तनात्‌॥१॥

बीजदाढ्‌र्य प्रकारस्तु गृहे स्थित्वा स्वधर्मतः।
अव्यावृत्तो भजेत्कृष्णं पूजया श्रवणादिभिः॥२॥

व्यावृतोsपि हरौ चित्तं श्रवणादौ यतेत्सदा।
ततः प्रेम तथाssसक्तिर्व्यसनं च यदा भवेत्‌॥३॥

बीजं तदुच्यते शास्त्रे दृढ़ं यन्नपि नश्यति।
स्नेहाद्रागविनाशः स्यादासत्तया स्याद्‌गृहारुचिः॥४॥

गृहस्थानां बाधकत्वमनात्मत्वं च भासते।
यदा स्याद्वयसनं कृष्णे कृतार्थः स्यात्तदैव हि॥५॥

ताद्यशस्यापि सततं गृहस्थानं विनाशकम्‌।
त्यागं कृत्वा यतेद्यस्तु तदर्थार्थैकमनसः॥६॥

लभेत सुदृढ़ां भक्तिं सर्वतोप्यधिकां पराम्‌।
त्यागे बाधकभूयस्त्वं दुःसंसएगात्तथान्नतः॥७॥

अतस्थेयं हरिस्थाने तदीयैः सह तत्परेः।
अदूरे विप्रकर्षे वा यथा चित्तं न दुष्यति ॥८॥

सेवायां वा कथायां वा यस्याssसक्तिर्दृढ़ा भवेत।
यावज्जीवं तस्य नाशो न क्वापीति मे मतिः॥९॥

बाधसंभावनायं तु नैकान्ते वास इष्यते।
हरिस्तु सर्वतो रक्षां करिष्यति न संशयः॥१०॥

इत्येवं भगवच्छास्त्रं गूढतत्वं निरूपितम्‌।
य एतत्‌समधीयेत तस्यापि स्याद्‌ दृढ़ा रतिः॥११॥

॥इति श्रीवल्लभाचार्यविरचित भक्तिवर्द्धिनी सम्पूर्णा॥''',
  ),
  PathavaliItem(
    id: "18",
    title: "पच्चपद्यानि",
    content: '''॥ पच्चपद्यानि ॥

श्रीकृष्णरसविक्षिप्तमानसा रतिवर्जिताः।
अनिर्वृतालोकवेदे ते मुख्याः श्रवणोत्सुकाः॥१॥

विक्लिन्नमनसो ये तु भगवत्स्मृतिविहृवलाः।
अर्थेकनिष्ठास्ते चापि मध्यमाः श्रवणोत्सुकाः॥२॥

निःसंदिग्धं कृष्णतत्वं सर्वभावेन ये विदुः।
तत्वावेशात्तु विकला निरोधाद्वा न चान्यथा॥३॥

पूर्णभावेन पूर्णाथाः कदाचित्त तु सर्वदा।
अन्यासक्तास्तु ये केचिदधमाः परिकीर्तिताः॥४॥

अनन्यमनसो मर्त्या उत्तमाः श्रवणादिषु।
देशकालद्रव्यकर्तृ मन्त्रकर्म प्रकारतः॥५॥

॥इति श्रीवल्लभाचार्यविरचितनि पच्चपद्यानि॥''',
  ),
  PathavaliItem(
    id: "19",
    title: "सन्यासनिर्णय",
    content: '''॥ सन्यासनिर्णय ॥

पश्चात्तपनिवृत्यर्थं परित्यागो विचार्यते।
स मार्गाद्वितये प्रोक्तो भक्तौ ज्ञाने विशेषतः॥१॥

कर्म मार्गे न कर्त्तव्यः सुतरां कलिकालतः।
अत आदौ भक्तिमार्गे कर्त्तव्यत्वाद्विचारणा॥२॥

श्रवणादिप्रसिद्धयर्थं कर्त्तव्यश्चेत्स नेष्यते।
सहाय संग साध्यत्वात्साधनानां च रक्षणात्‌॥३॥

अभिमानान्नियोगाच्च तद्‌धर्मैश्च विरोधतः।
गृहादेर्बाधकत्वेन साधनार्थं तथा यदि॥४॥

अग्रेsपि तादृशैरेव संगो भवति नान्यथा।
स्वयंच विषयाक्रान्तः पाषण्डी स्यात्तु कालतः॥५॥

विषयाक्रांत देहानां नावेशः सर्वथा हरेः।
अतोsत्र साधने भक्तौ नैव त्यागः सुखावहः॥६॥

विरहानुभवार्थ तु परित्यागः प्रशस्यते।
स्वीयबन्धनिवृत्यर्थं वेषः सोsत्र न चान्यथा॥७॥

कौण्डिन्यो गोपिकाः प्रोक्ता गुरवः साधनं च तत्‌।
भावो भावनया सिद्धः साधनं नान्यदिष्यते॥८॥

विकलत्वं तथाsस्वास्थ्यं प्रकृतिः प्राकृतं नहि।
ज्ञानं गुणाश्च तस्यैवं वर्त्तमानस्य बाधकाः॥९॥

सत्यलोके स्थितिर्ज्ञानात्संन्यासेन विशेषितात्‌।
भावना साधनं यत्र फलं चापि तथा भवेत्‌॥१०॥

तादृशाः सत्यलोकदौ  तिष्ठन्त्येव न संशयः।
बहिश्चेत्प्रकटः स्वात्मा वहिवत्प्रविशेद्यदि॥११॥

तदैव सकलोबन्धो नाशमेति न चान्यथा।
गुणास्तुसंगराहित्याज्जीवनार्थं भविन्ति हि॥१२॥

भगवान्‌ फलरूपत्वान्नात्र बाधक इष्यते।
स्वास्थ्यवाक्यं न कर्त्तव्यं दयालुर्न विरुद्धयेत॥१३॥

दुर्लभोsयं परित्यागः प्रेरणा सिद्धयति नान्यथा।
ज्ञानमार्गे तु सन्यासो द्विविधोsपि विचारितः॥१४॥

ज्ञानार्थमुत्तराग्ङञ्च सिद्धिर्जन्मशतैः परम्‌।
ज्ञानं च साधनापेक्षं यज्ञादिश्रवणान्मतम्‌॥१५॥

अतः कलौ स सन्यासः पश्चात्तापाय नान्यथा।
पाषण्डित्वं भवेच्चापि तस्माज्जाने न सन्यसेत्‌॥१६॥

सुतरां कलिदोषाणां प्रबलत्वादिति स्थितम्‌।
भक्तिमार्गेपिचेद्दोषस्तदा किं कार्यमुच्यते॥१७॥

अत्रारम्भे न नाशः स्याद्‌ दृष्टान्तस्याप्यभावतः।
स्वास्थ्यहेतोः परित्यागाद्‌ बाधः केनास्य संभवेत्‌॥१८॥

हरिरत्र न शक्नोति कर्तु बाधां कुतोsपरे।
अन्यथा मातरो बालान्‌ न स्तन्यैः पुपुषुः क्वचित्‌॥१९॥

“ज्ञानिनामपि” वाक्येन न भक्तं मोहयिष्यति।
आत्मप्रदः प्रियश्चापि किमर्थं मोहयोष्यति॥२०॥

तस्मादुक्तप्रकारेण परित्यागो विधीयताम्‌।
अन्यथा भ्रश्यते स्वार्थादिति में निश्चता मतिः॥२१॥

इति कृष्णप्रसादेन वल्लभेन विनिश्चतम्‌।
सन्यासावरणं भक्तावन्यथा पतितो भवेत्‌॥२२॥

॥इति श्रीवल्लभाचार्यविरचितः सन्यासनिर्णयः समाप्तः॥''',
  ),
  PathavaliItem(
    id: "20",
    title: "निरोधलक्षण",
    content: '''॥ निरोधलक्षण ॥

यच्च दुःखं यशोदाया नन्दादीनां च गोकुले।
गोपिकानां तु यद्‌दुःखं स्यान्मम क्वचित्‌॥१॥

गोकुले गोपिकानां च सर्वेषां व्रजवासिनाम्‌।
यत्सुखं समभूत्तन्मे भगवान्‌ किं विधास्यति॥२॥

उद्धवगमने जात उत्सवः सुमहान्‌ यथा।
वृन्दावने गोकुले वा  तथा मे मनसि क्वचित्‌॥३॥

महतां कृपयां यावद्‌ भगवान्‌ दययिष्यति।
तावदानन्दसन्दोहः कीर्त्यमानः सुखाय हि॥४॥

महतं कृपया यद्वत्‌ कीर्त्तनं सुखदं सदा।
न तथा लौकिकानां तु स्निग्धभिजनरुक्षवत॥५॥

गुणगाने सुखावाप्तिर्गोव्न्दस्य प्रजायते।
यथा तथा शुकादीनां नैवात्मनि कुतोsन्यतः॥६॥

क्लिश्यमानाच्जनान्‌ दृष्ट्‌वा कृपायुक्तो यदा भवेत्‌।
तदा सर्वं सदानन्दं हृदिस्थं निर्गतं बहिः॥७॥

सर्वानन्दमयस्यापि कृपानन्दः सुदुर्लभः।
हृद्‌गतः स्वगुणान्‌ श्रुत्वा पूर्णः प्लावयते जनान्‌॥८॥

त्स्मात्सर्वं परियज्य निरुद्धैः सर्वदा गुणाः।
सदानन्दपरैर्गेयाः सच्चिदानन्दता ततः॥९॥

अहं निरुद्धो रोधेन निरोधपदवीं गतः।
निरुद्धानं तु रोधायः निरोधं वर्णयामिते॥१०॥

हरिणा ये विनिर्मुक्तास्ते मग्ना भवसागरे।
ये निरुद्धास्त एवात्र मोदमायान्त्यहरिनिशम्‌॥११॥

संसारावेशदुष्टानामिन्द्रियाणां हिताय वै।
कृष्णस्य सर्ववस्तूनि भूम्न ईशस्य योजयेत्‌॥१२॥

गुणेष्वाविष्टचित्तानां सर्वदा मुरवैरिणः।
संसारविरहक्लेशौ न स्यातां हरिवत्सुखम्‌॥१३॥

तदा भवेद्‌दयालुत्वमन्यथा क्रूरता मता।
बाधशंकापि नास्त्यत्र तदध्यासोsपि सिद्धयति॥१४॥

भगवद्धर्म सामर्थ्यादिरागो विषये स्थिरः।
गुणैहरेः सुखस्पर्शान्न दुःखं भाति कर्हिचित्‌॥१५॥

एवं ज्ञात्वा ज्ञानमार्गादुत्कर्षं गुणवर्णने।
अमत्सरैरलुब्धैश्च वर्णनीयाः सदा गुणाः॥१६॥

हरिमूर्तिः सदा ध्येया संकल्पादपि तत्र हि।
दर्शनं स्पर्शनं स्पष्टं तथा कृतिगति सदा॥१७॥

श्रवणं कीर्त्तनं स्पष्टं पुत्रे कृष्णाप्रिये रतिः।
पायोर्मलांशत्यागेन शेषभागं तनौ नयेत्‌॥१८॥

यस्य वा भगवत्कार्य यदा स्पष्टं न दृश्यते।
तदा विनिग्रहस्तस्य कर्त्तव्य इति निश्चयः॥१९॥

नातः परतरो मन्त्रो नातः परतरः स्तवः।
नातः परतरा विद्या तीर्थं नातः परात्परम्‌॥२०॥
''',
  ),
];
